function checkPassword() {
    const passwordEntered = document.getElementById('password').value.trim();
    const correctPassword = 'kawbie'; // Set your password here
    const letter = `
        هاي حبي، سووو ملخر لا مقدمات لا والو ندخل في الموضوع وش حاب نقلك
        المهم اليوم يخي رانا 18 في الشهر يخي؟؟ وتعرفي عماد حبيبك جامي راطا نهار من هذو عندي 9 شهور يخي كل ليلة على 12 نبعثلك 
        HAPPY MONTHLY ANIVERSARY    
        يااه ما نقدرش نقلك شحال راني متوحشهااا شحال راني متوحشككك
        المهم درت هذي الضربة نتاع نبعثلك ميساج ويرد وفيه سيت باينة علاش غي باش يماك ولا باباك ما يشوفش الميساج وتحصلي
        واسمحيلي علابالي ريسكيت ودرتها مي كان لازم عليا كوثر ان شاء الله برك يكونو ما شافوهاش
        وزيد درت للسيت موتباس تاع اونكا ويفيقولك ادخلي للسيت تقوليلهم فيها موتباس وقيلا كاش سيت تاع اعلانات ولا فيروس واخرجي
        سمحيلي علابالي فيها الريسك بزاف
        كالعادة نحب نخدملك صوالح هكا مزال ان شاء الله نخدملك صوالح بزاف
        سووو خلي نهدر وش عندي كثرت بلا فايدة، المهم ما قدرتش نهدر اخر مرة كنتي تزربي المهم انا نحبك كوثر ديما نقولهالك
        لايكك نتي احسن حاجة صراتلي في الدنيا والله غي نموت عليك مزالني نموت عليك ليومنا هذا مستحيلل حاجة تفرق بيناتنا
        ومنيش جاي نقلك ارواحي نرجعو نكونو مع بضع لاخاطر حنا اصلا ما تسيباريناش ياك؟؟ مزالنا مع بعض ليوم الدين ان شاء الله
        غي كيما قتلي ما تقدريش تريسكي وانا ما نقدرش نريسكي بيك سوو لي حبيت نقولها راكي ديما في البال مزالني نحبك ليوم الدين
        كشما يجيك تخمام تاع يادرا عماد وش يكون يدير دوكا هذيك اللحظة كوني متأكدة راني نخمم فيك
        المهم عيشي حياتك دوكا لابين لا جيتك انا منبعد لي حاب نقولهالك اصبري عليا والله غي راني سيريو من نهار لي دخلت فيه معاك
        في الغولاصيون راني سيريو وعدتك بالخطبة والزواج عطيتك كلمة رجال وراني عند كلمتي مام نتي قلتيلي راك تبانلي سيريو
        وانا راني هنا معاك وعلابالي راكي عند كلمتك، يسما اصبريلي شوفي والله غي فيها خير علابالك؟
        نقلك حاجة لايك كنت مخبيها عليك انا من بكري يخي تعرفي حالتي مروبلة سوو كنت الصلاة ما نقدرش نصلي كي الناس نتهاون عليها
        وكلش مي نتي كي رحتي هكا نضت صليت ركعتين في نص الليل في هذيك الليلة بعد ودعيت ربي لايك عاهدتو ما تزيد تفوتني حتى صلاة
        يخي دوكا الصيف والجامع بحذايا يسموني نكون 24 ساعة فيه لايك دعيت هكا ربي ان شاء الله ما تزيد تفوتني حتى صلاة ما نزيدش نقصر
        في حقك ولي نطلبها اكتبلي الطفلة اكتبلي كوثر واجمع بيناتنا بالحلال ان شاء الله والله غي ناويك نية تاع حلال نتي بنت فاميلا
        تربية واخلاق الله يبارك عمي فاروق وعمتي راضية جابوك بالحلال نديك من عندهم بالحلال 
        يسما ربي بلعاني داك النهار لي تروحي فيه باش حنا فيزوج نرجعو لربي
        سووو اذا كان ربي كاتبك ليا علابالك ني يماك ني باباك ينحك من عندي علابالك بيها؟ لايك كي نخمم شوية نزعف رحتي عليا كنا نجوزو الوقت
        منبعد نتفكر بلي اذا ربي مكتبك ليا ماكاش لي ينحك علابالك نفرح؟؟ والله غي نبدا نتبسم غي وحدي ماكاش لي يفرق بينتنا كي نكونو
        مكتوبين لبعض ورانا مكتوبين لبعض كوثر ان شاء الله انا ليك وانتي ليا ان شاء الله
        سوو ايا كملي في حياتك لا ستراس لا والو ما تخمميش قع بالاك عماد مع الوقت ينساني ولا يكره مني نو نو نو قع ما تقوليهاش عماد ليك 
        وما عندو حتى بنادم وحدوخر في حياتو غي نتيا سوو كوني متهنية والله بعد شهر شهرين عام عامين راني جايك ونخدم في حياتي غي على 
        جال النهار لي نجيك مالباب لايك يفتحلي عمو فاروق ندخل وراسي مرفوع لايك نكون بخدمتي ودراهمي سمعة مريقلة مريقلها مع ربي
        تاع جاي نديك ملخر مافيهاش. نتاع كي عمي فاروق يمد بنتو يكون علابالو لمن عطاها ويكون متهني ما يخممش عليها
        والله غير من نيتي كوثر مزالنا صغار مي نكبرو ان شاء الله والله غي تصرا نتي برك عاونيني واستناي هذا ماكان وادعي ربي
        كل ما تصلي ادعي ياربي يكتبنا لبعض ياربي يسهلنا هكاا
        وانا كل يوم راني ندعيلك وندعيلنا وكلش
        وزيد العام الجاي عندك باك كانت نيتي نعاونك فيه من نهار لول للخر مي معليش انا نوصيك حاجة برك راهو رايح يطيحلك المورال 
        عادي كامل صراتلنا ديجا يخي تشفايلي انا تقوليلي نوض اقرا عماد بقالك شهر نحي الانستا وابدا تقرا وانا نقلك منيش باغي اخطيني
        لايك كان حاكمني ديبريسيون غي كيما بقات سمانة وياربي بديت نقرا
        المهم ما تديريش غلطتي انتي اقراي وماكاش لي يكذب عليك يقلك القراية تبدا من سبتمبر ولا مالصيف نو ابداي تقرا حطي مع القراية
        عادي ما تقتليش روحك راهو والله غي الباك ساهللل ما تسمعيش للناس تقلك راكي روطار ايا وين راكي انا راني كملت الحفيظة انا انا 
        كوثر سيريو انا الاجتماعيات والله ما علابالي وش رانا نقراو ليلة الرعد حفظت وطرطقت السوجي يسما والله غي ساهل
        يطيحلك المورال نورمال كامل تصرالنا يحكمك ستراس ايا راني روطار ما نلحقش والله غي نورمال تلحقي 
        وراني هنا علابالي تصرالك اذا طاحلك المورال ما يهمش تكوني تقرا ع 5 تاع الصباح عيطيلي عماد تعبت فرغي قلبك عندي 
        ما نسمحلكش كون ما تديريهاش وربي يوفقكككك 
        المهم هذا وش حبيت نقول نهار نتيجة الباك راني نعيطلك ما علاباليش ويكتا ويت ابعثيلي ميساج بلي عماد نقدر نهدر دوكا باش نعيطلك
        يسموك تفرحي معايا عام كامل ي الزح بدينا نمشيو من سبتمبر وفي اللخر ما تفرحيش معايا؟ مام ما نجيبوش ما يهمنيش
        يا تفرحي معايا يا يطيحلي المورال عندك المهم وقفتي معايا عام كامل لازم تحضري للنهاية
        وهذي هيا ربي يحفظك ويخليك ليا ونحبكككككككك 💗💗💗💗
وصحااا عيدكككك 💗💗
        التحت تلقاي )
        reply
       ( كليلي عليها يديك لسيت وحدوخر لثما اكتبي الميساج تاعك لايك ريبنوديلي غي باش نعرف برك بلي قريتي الميساج
    `;

    if (passwordEntered.toLowerCase() === correctPassword) {
        document.body.style.backgroundColor = "#FFF0F5";
        document.getElementById('password-container').style.display = 'none';
        const letterContainer = document.getElementById('letter-container');
        letterContainer.style.display = 'block';
        setTimeout(() => {
            letterContainer.classList.add('show');
        }, 100); // Delay to ensure display change is applied before opacity transition
        document.getElementById('letter').innerHTML = letter.replace(/\n/g, '<br>');
    } else {
        alert('Incorrect password. You know the password is the nickname I call you. it ends with "...bie"');
    }
}

function openReplyForm() {
    const googleFormLink = "https://docs.google.com/forms/d/e/1FAIpQLSdtIUwYrYskvtmvlsIJdWm0TOKixRu3ydZExTYQIHYWgkTtwQ/viewform?usp=sf_link";
    window.open(googleFormLink, '_blank');
}
